-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: mysql
-- Время создания: Мар 24 2024 г., 09:35
-- Версия сервера: 8.0.32
-- Версия PHP: 8.2.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `easy`
--

-- --------------------------------------------------------

--
-- Структура таблицы `people`
--

CREATE TABLE `people` (
  `id` bigint UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `surname` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `fathername` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `people`
--

INSERT INTO `people` (`id`, `name`, `surname`, `fathername`, `email`, `created_at`, `updated_at`) VALUES
(1, 'Юлия', 'Анисимов', 'Олегович', 'jerry99@yahoo.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(2, 'Елизавета', 'Бирюков', 'Олегович', 'izaiah65@hotmail.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(3, 'Нина', 'Борисова', 'Олегович', 'christelle07@jacobson.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(4, 'Федосья', 'Корнилова', 'Олегович', 'dimitri.hessel@osinski.biz', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(5, 'Иван', 'Молчанов', 'Иванович', 'kendall.ward@goldner.org', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(6, 'Изольда', 'Данилова', 'Олегович', 'sstracke@gmail.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(7, 'Давид', 'Кулаков', 'Олегович', 'lessie.casper@gmail.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(8, 'Валерий', 'Никонова', 'Иванович', 'maxine86@beer.info', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(9, 'Клим', 'Рябова', 'Олегович', 'spinka.myron@schumm.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(10, 'Иммануил', 'Прохорова', 'Олегович', 'leffler.vernice@yahoo.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(11, 'Милан', 'Константинов', 'Олегович', 'dasia.becker@hotmail.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(12, 'Максим', 'Евдокимов', 'Олегович', 'frami.kallie@luettgen.info', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(13, 'Фаина', 'Беспалов', 'Олегович', 'scummings@yahoo.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(14, 'Ника', 'Уварова', 'Олегович', 'green.rudy@yahoo.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(15, 'Диана', 'Андреев', 'Олегович', 'gaetano34@yahoo.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(16, 'Данила', 'Зуева', 'Олегович', 'noemi.schulist@halvorson.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(17, 'Олеся', 'Веселов', 'Олегович', 'uriah.connelly@gmail.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(18, 'Нелли', 'Капустин', 'Олегович', 'kheathcote@yahoo.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(19, 'Анатолий', 'Абрамов', 'Олегович', 'itzel.torp@mcglynn.org', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(20, 'Прохор', 'Гришина', 'Олегович', 'russel63@jones.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(21, 'Ирина', 'Беляков', 'Олегович', 'noemie65@ledner.info', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(22, 'Мирослав', 'Исаев', 'Олегович', 'mack.mueller@yahoo.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(23, 'Елена', 'Орлова', 'Олегович', 'carissa.grimes@gmail.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(24, 'Артур', 'Кондратьев', 'Олегович', 'gideon48@gmail.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(25, 'Милан', 'Капустин', 'Олегович', 'wdaniel@yahoo.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(26, 'Родион', 'Михайлова', 'Олегович', 'bridget.larkin@armstrong.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(27, 'Вячеслав', 'Блохин', 'Олегович', 'kihn.beau@yost.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(28, 'Семён', 'Смирнова', 'Олегович', 'strosin.trycia@yahoo.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(29, 'Денис', 'Осипова', 'Олегович', 'mckenzie.ernesto@quigley.org', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(30, 'Геннадий', 'Фёдорова', 'Олегович', 'earnest78@hauck.net', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(31, 'Гордей', 'Третьякова', 'Олегович', 'estark@gmail.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(32, 'Анжелика', 'Давыдова', 'Олегович', 'stark.ben@hotmail.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(33, 'Розалина', 'Сафонов', 'Олегович', 'farrell.joshuah@hotmail.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(34, 'София', 'Костин', 'Олегович', 'kennith48@kulas.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(35, 'Варвара', 'Яковлев', 'Олегович', 'muriel.satterfield@gmail.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(36, 'Андрей', 'Одинцова', 'Олегович', 'alfreda.schiller@gmail.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(37, 'Эдуард', 'Ситников', 'Олегович', 'oceane13@bayer.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(38, 'Розалина', 'Никитина', 'Олегович', 'mking@hotmail.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(39, 'Антон', 'Михайлова', 'Олегович', 'wilbert70@gmail.com', '2024-03-24 08:54:41', '2024-03-24 08:54:41'),
(40, 'Аким', 'Назарова', 'Олегович', 'erunte@schiller.com', '2024-03-24 08:54:42', '2024-03-24 08:54:42'),
(41, 'Вениамин', 'Доронин', 'Олегович', 'dejuan.kreiger@bins.com', '2024-03-24 08:54:42', '2024-03-24 08:54:42'),
(42, 'Гордей', 'Шубин', 'Олегович', 'nicolas.andrew@denesik.com', '2024-03-24 08:54:42', '2024-03-24 08:54:42'),
(43, 'Никодим', 'Дементьева', 'Олегович', 'lesly43@schumm.biz', '2024-03-24 08:54:42', '2024-03-24 08:54:42'),
(44, 'Ульяна', 'Авдеев', 'Олегович', 'magnus07@yahoo.com', '2024-03-24 08:54:42', '2024-03-24 08:54:42'),
(45, 'Алина', 'Денисов', 'Олегович', 'cummerata.deanna@durgan.net', '2024-03-24 08:54:42', '2024-03-24 08:54:42'),
(46, 'Федосья', 'Козлов', 'Олегович', 'fdubuque@yahoo.com', '2024-03-24 08:54:42', '2024-03-24 08:54:42'),
(47, 'Вероника', 'Ситникова', 'Олегович', 'jimmie16@rice.com', '2024-03-24 08:54:42', '2024-03-24 08:54:42'),
(48, 'Вера', 'Герасимов', 'Олегович', 'santa.upton@maggio.info', '2024-03-24 08:54:42', '2024-03-24 08:54:42'),
(49, 'Василиса', 'Сергеева', 'Олегович', 'yhamill@senger.com', '2024-03-24 08:54:42', '2024-03-24 08:54:42'),
(50, 'Эмма', 'Белов', 'Олегович', 'prosacco.naomi@parker.com', '2024-03-24 08:54:42', '2024-03-24 08:54:42');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `people`
--
ALTER TABLE `people`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `people_email_unique` (`email`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `people`
--
ALTER TABLE `people`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
